Repository: sushmidha06/aroghya
Catalog: lib/l10n/app_*.arb
Languages: bn

# appTitle
source: Aroghya AI
bn: আরোগ্য AI

source: Home
bn: হোম

source: Profile
bn: প্রোফাইল

source: Settings
bn: সেটিংস

# vault
source: Medical Vault
bn: মেডিকেল ভল্ট

source: Symptom Checker
bn: লক্ষণ পরীক্ষক

source: AI Recommendations
bn: AI সুপারিশ

source: Appointments
bn: অ্যাপয়েন্টমেন্ট

source: Medications
bn: ওষুধ

source: Emergency Contacts
bn: জরুরি যোগাযোগ

source: Welcome back
bn: আবার স্বাগতম,

source: Account Information
bn: অ্যাকাউন্ট তথ্য

source: Account Status
bn: অ্যাকাউন্ট স্ট্যাটাস

source: Active
bn: সক্রিয়

source: Security
bn: নিরাপত্তা

source: Password Protected
bn: পাসওয়ার্ড সুরক্ষিত

source: Last Login
bn: শেষ লগইন

source: Today
bn: আজ

source: Data Storage
bn: ডেটা স্টোরেজ

source: Local Device
bn: স্থানীয় ডিভাইস

source: Language
bn: ভাষা

source: Select Language
bn: ভাষা নির্বাচন করুন

source: English
bn: English (ইংরেজি)

# hindi
source: हिन्दी (Hindi)
bn: हिन्दी (হিন্দি)

# tamil
source: தமிழ் (Tamil)
bn: தமிழ் (তামিল)

# telugu
source: తెలుగు (Telugu)
bn: తెలుగు (তেলুগু)

# bengali
source: বাংলা (Bengali)
bn: বাংলা

# describeSymptoms
source: Describe Your Symptoms
bn: আপনার লক্ষণগুলি বর্ণনা করুন

source: Quick Select Symptoms:
bn: দ্রুত লক্ষণ নির্বাচন:

source: Analyze Symptoms with AI
bn: AI দিয়ে লক্ষণ বিশ্লেষণ করুন

# analyzingWithGemma
source: Analyzing with Gemma 3...
bn: Gemma 3 দিয়ে বিশ্লেষণ করছে...

# enterVitalsOptional
source: Enter Your Vitals (Optional)
bn: আপনার ভাইটাল এন্টার করুন (ঐচ্ছিক)

# temperature
source: Temperature (°F)
bn: তাপমাত্রা (°F)

source: Blood Pressure
bn: রক্তচাপ

# heartRate
source: Heart Rate (bpm)
bn: হৃদস্পন্দন (bpm)

source: Emergency Actions
bn: জরুরি পদক্ষেপ

source: Emergency
bn: জরুরি অবস্থা

source: Call Doctor
bn: ডাক্তারকে কল করুন

source: Search documents...
bn: নথি খুঁজুন...

source: Upload Document
bn: নথি আপলোড করুন

# documentUploaded
source: Document uploaded successfully
bn: নথি সফলভাবে আপলোড হয়েছে

# errorProcessingDocument
source: Error processing document: {error}
bn: নথি প্রক্রিয়াকরণে ত্রুটি: {error}

source: AI Health Recommendations
bn: AI স্বাস্থ্য সুপারিশ

source: Error loading recommendations
bn: সুপারিশ লোড করতে ত্রুটি

source: Retry
bn: আবার চেষ্টা করুন

source: Daily Health Tips
bn: দৈনিক স্বাস্থ্য টিপস

source: Stay hydrated
bn: হাইড্রেটেড থাকুন

source: Take short breaks
bn: ছোট বিরতি নিন

source: Get enough sleep
bn: পর্যাপ্ত ঘুম পান

source: Exercise regularly
bn: নিয়মিত ব্যায়াম করুন

source: Speak now...
bn: এখন বলুন...

# listeningForSpeech
source: Listening for speech in {language}
bn: {language} এ কথা শুনছে

# speechRecognitionError
source: Speech recognition error: {error}
bn: বক্তৃতা চিনতে ত্রুটি: {error}

source: Translating...
bn: অনুবাদ করছে...

source: Translation complete
bn: অনুবাদ সম্পূর্ণ

source: Insurance
bn: বীমা

source: Add Medication
bn: ওষুধ যোগ করুন

source: Medication Name
bn: ওষুধের নাম

source: Dosage
bn: ডোজ

source: Frequency
bn: ফ্রিকোয়েন্সি

source: Start Date
bn: শুরুর তারিখ

source: End Date
bn: শেষের তারিখ

source: Notes
bn: নোট

# medicationAdded
source: Medication added successfully
bn: ওষুধ সফলভাবে যোগ করা হয়েছে

# medicationUpdated
source: Medication updated successfully
bn: ওষুধ সফলভাবে আপডেট করা হয়েছে

# medicationDeleted
source: Medication deleted successfully
bn: ওষুধ সফলভাবে মুছে ফেলা হয়েছে

# deleteMedicationConfirm
source: Are you sure you want to delete this medication?
bn: আপনি কি নিশ্চিত যে আপনি এই ওষুধটি মুছে ফেলতে চান?

source: Medication Alerts
bn: ওষুধের সতর্কতা

# timeToTakeMedication
source: Time to take your medication
bn: ওষুধ খাওয়ার সময়

source: Mark as Taken
bn: নেওয়া হয়েছে হিসেবে চিহ্নিত করুন

source: Snooze
bn: স্নুজ

source: Skip
bn: এড়িয়ে যান

source: Schedule Appointment
bn: অ্যাপয়েন্টমেন্ট নির্ধারণ করুন

source: Doctor Name
bn: ডাক্তারের নাম

source: Appointment Date
bn: অ্যাপয়েন্টমেন্টের তারিখ

source: Appointment Time
bn: অ্যাপয়েন্টমেন্টের সময়

source: Appointment Type
bn: অ্যাপয়েন্টমেন্টের ধরন

source: Appointment Notes
bn: অ্যাপয়েন্টমেন্টের নোট

# appointmentScheduled
source: Appointment scheduled successfully
bn: অ্যাপয়েন্টমেন্ট সফলভাবে নির্ধারিত হয়েছে

# appointmentUpdated
source: Appointment updated successfully
bn: অ্যাপয়েন্টমেন্ট সফলভাবে আপডেট করা হয়েছে

source: Appointment cancelled
bn: অ্যাপয়েন্টমেন্ট বাতিল করা হয়েছে

# cancelAppointmentConfirm
source: Are you sure you want to cancel this appointment?
bn: আপনি কি নিশ্চিত যে আপনি এই অ্যাপয়েন্টমেন্টটি বাতিল করতে চান?

source: Upcoming Appointments
bn: আসন্ন অ্যাপয়েন্টমেন্ট

source: Past Appointments
bn: পূর্ববর্তী অ্যাপয়েন্টমেন্ট

# noAppointments
source: No appointments scheduled
bn: কোনো অ্যাপয়েন্টমেন্ট নির্ধারিত নেই

# emergencyContactName
source: Contact Name
bn: যোগাযোগের নাম

# emergencyContactPhone
source: Phone Number
bn: ফোন নম্বর

# emergencyContactRelation
source: Relationship
bn: সম্পর্ক

source: Add Emergency Contact
bn: জরুরি যোগাযোগ যোগ করুন

source: Edit Emergency Contact
bn: জরুরি যোগাযোগ সম্পাদনা করুন

source: Delete Emergency Contact
bn: জরুরি যোগাযোগ মুছে ফেলুন

# emergencyContactAdded
source: Emergency contact added successfully
bn: জরুরি যোগাযোগ সফলভাবে যোগ করা হয়েছে

# emergencyContactUpdated
source: Emergency contact updated successfully
bn: জরুরি যোগাযোগ সফলভাবে আপডেট করা হয়েছে

# emergencyContactDeleted
source: Emergency contact deleted successfully
bn: জরুরি যোগাযোগ সফলভাবে মুছে ফেলা হয়েছে

# deleteContactConfirm
source: Are you sure you want to delete this contact?
bn: আপনি কি নিশ্চিত যে আপনি এই যোগাযোগটি মুছে ফেলতে চান?

source: Call Emergency Contact
bn: জরুরি যোগাযোগে কল করুন

# noEmergencyContacts
source: No emergency contacts added
bn: কোনো জরুরি যোগাযোগ যোগ করা হয়নি

source: Health Claim Tracker
bn: স্বাস্থ্য দাবি ট্র্যাকার

source: File New Claim
bn: নতুন দাবি দাখিল করুন

source: Claim Status
bn: দাবির অবস্থা

source: Policy Number
bn: পলিসি নম্বর

source: Hospital Name
bn: হাসপাতালের নাম

source: Patient Name
bn: রোগীর নাম

source: Admission Date
bn: ভর্তির তারিখ

source: Diagnosis
bn: রোগ নির্ণয়

source: Claim Amount
bn: দাবির পরিমাণ

source: Documents Required
bn: প্রয়োজনীয় নথি

source: Upload Documents
bn: নথি আপলোড করুন

# claimSubmitted
source: Claim submitted successfully
bn: দাবি সফলভাবে জমা দেওয়া হয়েছে

# claimUpdated
source: Claim updated successfully
bn: দাবি সফলভাবে আপডেট করা হয়েছে

source: Claim Approved
bn: দাবি অনুমোদিত

source: Claim Rejected
bn: দাবি প্রত্যাখ্যাত

source: Claim Pending
bn: দাবি অপেক্ষমাণ

source: Documents Needed
bn: নথি প্রয়োজন

# noClaims
source: No claims found
bn: কোনো দাবি পাওয়া যায়নি

source: Personal Information
bn: ব্যক্তিগত তথ্য

source: Full Name
bn: পূর্ণ নাম

source: Email
bn: ইমেইল

source: Phone Number
bn: ফোন নম্বর

source: Date of Birth
bn: জন্ম তারিখ

source: Gender
bn: লিঙ্গ

source: Blood Group
bn: রক্তের গ্রুপ

source: Allergies
bn: অ্যালার্জি

source: Medical History
bn: চিকিৎসা ইতিহাস

# profileUpdated
source: Profile updated successfully
bn: প্রোফাইল সফলভাবে আপডেট করা হয়েছে

# profileUpdateError
source: Error updating profile
bn: প্রোফাইল আপডেট করতে ত্রুটি

source: Fever
bn: জ্বর

source: Cough
bn: কাশি

source: Headache
bn: মাথাব্যথা

source: Nausea
bn: বমি বমি ভাব

source: Fatigue
bn: ক্লান্তি

source: Body Ache
bn: শরীর ব্যথা

source: Sore Throat
bn: গলা ব্যথা

source: Runny Nose
bn: নাক দিয়ে পানি পড়া

source: Dizziness
bn: মাথা ঘোরা

source: Chest Pain
bn: বুকে ব্যথা

source: Shortness of Breath
bn: শ্বাসকষ্ট

source: Stomach Pain
bn: পেট ব্যথা

source: Mild
bn: হালকা

source: Moderate
bn: মাঝারি

source: Severe
bn: গুরুতর

source: Critical
bn: অত্যন্ত গুরুতর

source: Male
bn: পুরুষ

source: Female
bn: মহিলা

source: Other
bn: অন্যান্য

source: Prefer not to say
bn: বলতে চাই না

source: Daily
bn: দৈনিক

source: Twice Daily
bn: দিনে দুইবার

source: Three Times Daily
bn: দিনে তিনবার

source: Weekly
bn: সাপ্তাহিক

source: As Needed
bn: প্রয়োজন অনুযায়ী

source: Required
bn: প্রয়োজনীয়

source: Optional
bn: ঐচ্ছিক

# pleaseEnterValue
source: Please enter a value
bn: অনুগ্রহ করে একটি মান লিখুন

# pleaseSelectDate
source: Please select a date
bn: অনুগ্রহ করে একটি তারিখ নির্বাচন করুন

# pleaseSelectTime
source: Please select a time
bn: অনুগ্রহ করে একটি সময় নির্বাচন করুন

# invalidEmail
source: Please enter a valid email
bn: অনুগ্রহ করে একটি বৈধ ইমেইল লিখুন

# invalidPhone
source: Please enter a valid phone number
bn: অনুগ্রহ করে একটি বৈধ ফোন নম্বর লিখুন

# fieldRequired
source: This field is required
bn: এই ক্ষেত্রটি প্রয়োজনীয়

source: Camera
bn: ক্যামেরা

source: Gallery
bn: গ্যালারি

source: Choose upload method
bn: আপলোড পদ্ধতি নির্বাচন করুন

source: Save
bn: সেভ করুন

source: Cancel
bn: বাতিল করুন

source: Delete
bn: মুছে ফেলুন

source: Edit
bn: সম্পাদনা করুন

source: Close
bn: বন্ধ করুন

source: OK
bn: ঠিক আছে

source: Yes
bn: হ্যাঁ

source: No
bn: না

source: Loading...
bn: লোড হচ্ছে...

source: Error
bn: ত্রুটি

source: Success
bn: সফল

source: Logout
bn: লগআউট

# logoutConfirmation
source: Are you sure you want to logout?
bn: আপনি কি নিশ্চিত যে আপনি লগআউট করতে চান?

source: Logged out successfully
bn: সফলভাবে লগআউট হয়েছে

# logoutError
source: Logout error: {error}
bn: লগআউট ত্রুটি: {error}
